<?xml version="1.0" encoding="utf-8"?>
<!-- (c) 2015 Seth Wright (wrightst@jmu.edu) for James Madison University -->
<policyDefinitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
    <policyNamespaces>
        <target prefix="schannel" namespace="JMU.Policies.Schannel" />
        <!--<using prefix="jmu" namespace="JMU.Policies.JMU" />-->
        <using prefix="windows" namespace="Microsoft.Policies.Windows" />
        <using prefix="cypherstrength" namespace="Microsoft.Policies.CypherStrength" />
    </policyNamespaces>
    <resources minRequiredRevision="1.0" />
    <categories>
        <category name="Protocols" displayName="$(string.Protocols)">
            <parentCategory ref="cypherstrength:SSLConfiguration" />
        </category>
        <category name="WeakProtocols" displayName="$(string.WeakProtocols)">
            <parentCategory ref="schannel:Protocols" />
        </category>
        <category name="Ciphers" displayName="$(string.Ciphers)">
            <parentCategory ref="cypherstrength:SSLConfiguration" />
        </category>
        <category name="WeakCiphers" displayName="$(string.WeakCiphers)">
            <parentCategory ref="schannel:Ciphers" />
        </category>
        <category name="Hashes" displayName="$(string.Hashes)">
            <parentCategory ref="cypherstrength:SSLConfiguration" />
        </category>
        <category name="KeyEx" displayName="$(string.KeyEx)">
            <parentCategory ref="cypherstrength:SSLConfiguration" />
        </category>
    </categories>

    <policies>
        <!-- PROTOCOLS -->

        <!-- Multi-Protocol Unified Hello should always be disabled, and Schannel will
             apparently never use it. -->
        <policy name="MPUH" class="Machine" displayName="$(string.MPUH)" explainText="$(string.MPUH_Help)" presentation="$(presentation.MPUH)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\Multi-Protocol Unified Hello">
            <parentCategory ref="WeakProtocols" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="MPUH_ClientCheckbox" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\Multi-Protocol Unified Hello\Client" valueName="">
                    <trueList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\Multi-Protocol Unified Hello\Client">
                        <item valueName="Enabled">
                            <value><decimal value="1" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="0" /></value>
                        </item>
                    </trueList>
                    <falseList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\Multi-Protocol Unified Hello\Client">
                        <item valueName="Enabled">
                            <value><decimal value="0" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="1" /></value>
                        </item>
                    </falseList>
                </boolean>
                <boolean id="MPUH_ServerCheckbox" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\Multi-Protocol Unified Hello\Server" valueName="">
                    <trueList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\Multi-Protocol Unified Hello\Server">
                        <item valueName="Enabled">
                            <value><decimal value="1" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="0" /></value>
                        </item>
                    </trueList>
                    <falseList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\Multi-Protocol Unified Hello\Server">
                        <item valueName="Enabled">
                            <value><decimal value="0" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="1" /></value>
                        </item>
                    </falseList>
                </boolean>
            </elements>
        </policy>

        <!-- PCT 1.0 should always be disabled, and Schannel will
             apparently never use it. -->
        <policy name="PCTv1" class="Machine" displayName="$(string.PCTv1)" explainText="$(string.PCTv1_Help)" presentation="$(presentation.PCTv1)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\PCT 1.0">
            <parentCategory ref="WeakProtocols" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="PCTv1_ClientCheckbox" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\PCT 1.0\Client" valueName="">
                    <trueList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\PCT 1.0\Client">
                        <item valueName="Enabled">
                            <value><decimal value="1" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="0" /></value>
                        </item>
                    </trueList>
                    <falseList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\PCT 1.0\Client">
                        <item valueName="Enabled">
                            <value><decimal value="0" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="1" /></value>
                        </item>
                    </falseList>
                </boolean>
                <boolean id="PCTv1_ServerCheckbox" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\PCT 1.0\Server" valueName="">
                    <trueList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\PCT 1.0\Server">
                        <item valueName="Enabled">
                            <value><decimal value="1" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="0" /></value>
                        </item>
                    </trueList>
                    <falseList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\PCT 1.0\Server">
                        <item valueName="Enabled">
                            <value><decimal value="0" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="1" /></value>
                        </item>
                    </falseList>
                </boolean>
            </elements>
        </policy>

        <!-- SSLv2 should always be disabled. -->
        <policy name="SSLv2" class="Machine" displayName="$(string.SSLv2)" explainText="$(string.SSLv2_Help)" presentation="$(presentation.SSLv2)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\SSL 2.0">
            <parentCategory ref="WeakProtocols" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="SSLv2_ClientCheckbox" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\SSL 2.0\Client" valueName="">
                    <trueList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\SSL 2.0\Client">
                        <item valueName="Enabled">
                            <value><decimal value="1" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="0" /></value>
                        </item>
                    </trueList>
                    <falseList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\SSL 2.0\Client">
                        <item valueName="Enabled">
                            <value><decimal value="0" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="1" /></value>
                        </item>
                    </falseList>
                </boolean>
                <boolean id="SSLv2_ServerCheckbox" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\SSL 2.0\Server" valueName="">
                    <trueList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\SSL 2.0\Server">
                        <item valueName="Enabled">
                            <value><decimal value="1" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="0" /></value>
                        </item>
                    </trueList>
                    <falseList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\SSL 2.0\Server">
                        <item valueName="Enabled">
                            <value><decimal value="0" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="1" /></value>
                        </item>
                    </falseList>
                </boolean>
            </elements>
        </policy>

        <!-- SSLv3 should be disabled -->
        <policy name="SSLv3" class="Machine" displayName="$(string.SSLv3)" explainText="$(string.SSLv3_Help)" presentation="$(presentation.SSLv3)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\SSL 3.0">
            <parentCategory ref="WeakProtocols" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="SSLv3_ClientCheckbox" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\SSL 3.0\Client" valueName="">
                    <trueList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\SSL 3.0\Client">
                        <item valueName="Enabled">
                            <value><decimal value="1" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="0" /></value>
                        </item>
                    </trueList>
                    <falseList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\SSL 3.0\Client">
                        <item valueName="Enabled">
                            <value><decimal value="0" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="1" /></value>
                        </item>
                    </falseList>
                </boolean>
                <boolean id="SSLv3_ServerCheckbox" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\SSL 3.0\Server" valueName="">
                    <trueList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\SSL 3.0\Server">
                        <item valueName="Enabled">
                            <value><decimal value="1" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="0" /></value>
                        </item>
                    </trueList>
                    <falseList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\SSL 3.0\Server">
                        <item valueName="Enabled">
                            <value><decimal value="0" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="1" /></value>
                        </item>
                    </falseList>
                </boolean>
            </elements>
        </policy>

        <!-- TLSv1.0 -->
        <policy name="TLSv1.0" class="Machine" displayName="$(string.TLSv10)" explainText="$(string.TLSv10_Help)" presentation="$(presentation.TLSv10)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.0">
            <parentCategory ref="Protocols" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="TLSv10_ClientCheckbox" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.0\Client" valueName="">
                    <trueList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.0\Client">
                        <item valueName="Enabled">
                            <value><decimal value="1" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="0" /></value>
                        </item>
                    </trueList>
                    <falseList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.0\Client">
                        <item valueName="Enabled">
                            <value><decimal value="0" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="1" /></value>
                        </item>
                    </falseList>
                </boolean>
                <boolean id="TLSv10_ServerCheckbox" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.0\Server" valueName="">
                    <trueList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.0\Server">
                        <item valueName="Enabled">
                            <value><decimal value="1" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="0" /></value>
                        </item>
                    </trueList>
                    <falseList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.0\Server">
                        <item valueName="Enabled">
                            <value><decimal value="0" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="1" /></value>
                        </item>
                    </falseList>
                </boolean>
            </elements>
        </policy>

        <!-- TLSv1.1 -->
        <policy name="TLSv1.1" class="Machine" displayName="$(string.TLSv11)" explainText="$(string.TLSv11_Help)" presentation="$(presentation.TLSv11)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.1">
            <parentCategory ref="Protocols" />
            <supportedOn ref="windows:SUPPORTED_Windows7" />
            <elements>
                <boolean id="TLSv11_ClientCheckbox" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.1\Client" valueName="">
                    <trueList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.1\Client">
                        <item valueName="Enabled">
                            <value><decimal value="1" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="0" /></value>
                        </item>
                    </trueList>
                    <falseList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.1\Client">
                        <item valueName="Enabled">
                            <value><decimal value="0" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="1" /></value>
                        </item>
                    </falseList>
                </boolean>
                <boolean id="TLSv11_ServerCheckbox" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.1\Server" valueName="">
                    <trueList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.1\Server">
                        <item valueName="Enabled">
                            <value><decimal value="1" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="0" /></value>
                        </item>
                    </trueList>
                    <falseList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.1\Server">
                        <item valueName=""><value><decimal value="" /></value></item>
                        <item valueName="Enabled">
                            <value><decimal value="0" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="1" /></value>
                        </item>
                    </falseList>
                </boolean>
            </elements>
        </policy>

        <!-- TLSv1.2 -->
        <policy name="TLSv1.2" class="Machine" displayName="$(string.TLSv12)" explainText="$(string.TLSv12_Help)" presentation="$(presentation.TLSv12)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\SSL 3.0">
            <parentCategory ref="Protocols" />
            <supportedOn ref="windows:SUPPORTED_Windows8" />
            <elements>
                <boolean id="TLSv12_ClientCheckbox" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.2\Client" valueName="">
                    <trueList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.2\Client">
                        <item valueName="Enabled">
                            <value><decimal value="1" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="0" /></value>
                        </item>
                    </trueList>
                    <falseList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.2\Client">
                        <item valueName="Enabled">
                            <value><decimal value="0" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="1" /></value>
                        </item>
                    </falseList>
                </boolean>
                <boolean id="TLSv12_ServerCheckbox" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.2\Server" valueName="">
                    <trueList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.2\Server">
                        <item valueName="Enabled">
                            <value><decimal value="1" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="0" /></value>
                        </item>
                    </trueList>
                    <falseList defaultKey="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.2\Server">
                        <item valueName="Enabled">
                            <value><decimal value="0" /></value>
                        </item>
                        <item valueName="DisabledByDefault">
                            <value><decimal value="1" /></value>
                        </item>
                    </falseList>
                </boolean>
            </elements>
        </policy>


        <!-- CIPHERS -->

        <!-- NULL -->
        <policy name="NULL" class="Machine" displayName="$(string.NULL)" explainText="$(string.NULL_Help)" presentation="$(presentation.NULL)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Ciphers\NULL">
            <parentCategory ref="WeakCiphers" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="NULL_Checkbox" valueName="Enabled">
                    <trueValue>
                        <decimal value="4294967295" />
                    </trueValue>
                    <falseValue>
                        <decimal value="0" />
                    </falseValue>
                </boolean>
            </elements>
        </policy>

        <!-- DES 56/56 -->
        <policy name="DES_56" class="Machine" displayName="$(string.DES_56)" explainText="$(string.DES_56_Help)" presentation="$(presentation.DES_56)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Ciphers\DES 56/56">
            <parentCategory ref="WeakCiphers" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="DES_56_Checkbox" valueName="Enabled">
                    <trueValue>
                        <decimal value="4294967295" />
                    </trueValue>
                    <falseValue>
                        <decimal value="0" />
                    </falseValue>
                </boolean>
            </elements>
        </policy>

        <!-- RC2 40/128 -->
        <policy name="RC2_40" class="Machine" displayName="$(string.RC2_40)" explainText="$(string.RC2_40_Help)" presentation="$(presentation.RC2_40)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Ciphers\RC2 40/128">
            <parentCategory ref="WeakCiphers" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="RC2_40_Checkbox" valueName="Enabled">
                    <trueValue>
                        <decimal value="4294967295" />
                    </trueValue>
                    <falseValue>
                        <decimal value="0" />
                    </falseValue>
                </boolean>
            </elements>
        </policy>

        <!-- RC2 56/128 -->
        <policy name="RC2_56" class="Machine" displayName="$(string.RC2_56)" explainText="$(string.RC2_56_Help)" presentation="$(presentation.RC2_56)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Ciphers\RC2 56/128">
            <parentCategory ref="WeakCiphers" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="RC2_56_Checkbox" valueName="Enabled">
                    <trueValue>
                        <decimal value="4294967295" />
                    </trueValue>
                    <falseValue>
                        <decimal value="0" />
                    </falseValue>
                </boolean>
            </elements>
        </policy>

        <!-- RC2 128/128 -->
        <policy name="RC2_128" class="Machine" displayName="$(string.RC2_128)" explainText="$(string.RC2_128_Help)" presentation="$(presentation.RC2_128)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Ciphers\RC2 128/128">
            <parentCategory ref="WeakCiphers" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="RC2_128_Checkbox" valueName="Enabled">
                    <trueValue>
                        <decimal value="4294967295" />
                    </trueValue>
                    <falseValue>
                        <decimal value="0" />
                    </falseValue>
                </boolean>
            </elements>
        </policy>

        <!-- RC4 40/128 -->
        <policy name="RC4_40" class="Machine" displayName="$(string.RC4_40)" explainText="$(string.RC4_40_Help)" presentation="$(presentation.RC4_40)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Ciphers\RC4 40/128">
            <parentCategory ref="WeakCiphers" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="RC4_40_Checkbox" valueName="Enabled">
                    <trueValue>
                        <decimal value="4294967295" />
                    </trueValue>
                    <falseValue>
                        <decimal value="0" />
                    </falseValue>
                </boolean>
            </elements>
        </policy>

        <!-- RC4 56/128 -->
        <policy name="RC4_56" class="Machine" displayName="$(string.RC4_56)" explainText="$(string.RC4_56_Help)" presentation="$(presentation.RC4_56)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Ciphers\RC4 56/128">
            <parentCategory ref="WeakCiphers" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="RC4_56_Checkbox" valueName="Enabled">
                    <trueValue>
                        <decimal value="4294967295" />
                    </trueValue>
                    <falseValue>
                        <decimal value="0" />
                    </falseValue>
                </boolean>
            </elements>
        </policy>

        <!-- RC4 64/128 -->
        <policy name="RC4_64" class="Machine" displayName="$(string.RC4_64)" explainText="$(string.RC4_64_Help)" presentation="$(presentation.RC4_64)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Ciphers\RC4 64/128">
            <parentCategory ref="WeakCiphers" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="RC4_64_Checkbox" valueName="Enabled">
                    <trueValue>
                        <decimal value="4294967295" />
                    </trueValue>
                    <falseValue>
                        <decimal value="0" />
                    </falseValue>
                </boolean>
            </elements>
        </policy>

        <!-- RC4 128/128 -->
        <policy name="RC4_128" class="Machine" displayName="$(string.RC4_128)" explainText="$(string.RC4_128_Help)" presentation="$(presentation.RC4_128)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Ciphers\RC4 128/128">
            <parentCategory ref="WeakCiphers" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="RC4_128_Checkbox" valueName="Enabled">
                    <trueValue>
                        <decimal value="4294967295" />
                    </trueValue>
                    <falseValue>
                        <decimal value="0" />
                    </falseValue>
                </boolean>
            </elements>
        </policy>

        <!-- Triple-DES 168/168 -->
        <policy name="3DES" class="Machine" displayName="$(string.3DES)" explainText="$(string.3DES_Help)" presentation="$(presentation.3DES)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Ciphers\Triple DES 168/168">
            <parentCategory ref="Ciphers" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="3DES_Checkbox" valueName="Enabled">
                    <trueValue>
                        <decimal value="4294967295" />
                    </trueValue>
                    <falseValue>
                        <decimal value="0" />
                    </falseValue>
                </boolean>
            </elements>
        </policy>

        <!-- AES 128/128 -->
        <policy name="AES128" class="Machine" displayName="$(string.AES128)" explainText="$(string.AES128_Help)" presentation="$(presentation.AES128)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Ciphers\AES 128/128">
            <parentCategory ref="Ciphers" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="AES128_Checkbox" valueName="Enabled">
                    <trueValue>
                        <decimal value="4294967295" />
                    </trueValue>
                    <falseValue>
                        <decimal value="0" />
                    </falseValue>
                </boolean>
            </elements>
        </policy>

        <!-- AES 256/256 -->
        <policy name="AES256" class="Machine" displayName="$(string.AES256)" explainText="$(string.AES256_Help)" presentation="$(presentation.AES256)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Ciphers\AES 256/256">
            <parentCategory ref="Ciphers" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="AES256_Checkbox" valueName="Enabled">
                    <trueValue>
                        <decimal value="4294967295" />
                    </trueValue>
                    <falseValue>
                        <decimal value="0" />
                    </falseValue>
                </boolean>
            </elements>
        </policy>


        <!-- HASHING ALGORITHMS -->

        <!-- MD5 -->
        <policy name="MD5" class="Machine" displayName="$(string.MD5)" explainText="$(string.MD5_Help)" presentation="$(presentation.MD5)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Hashes\MD5">
            <parentCategory ref="Hashes" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="MD5_Checkbox" valueName="Enabled">
                    <trueValue>
                        <decimal value="4294967295" />
                    </trueValue>
                    <falseValue>
                        <decimal value="0" />
                    </falseValue>
                </boolean>
            </elements>
        </policy>

        <!-- SHA-1 -->
        <policy name="SHA" class="Machine" displayName="$(string.SHA)" explainText="$(string.SHA_Help)" presentation="$(presentation.SHA)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Hashes\SHA">
            <parentCategory ref="Hashes" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="SHA_Checkbox" valueName="Enabled">
                    <trueValue>
                        <decimal value="4294967295" />
                    </trueValue>
                    <falseValue>
                        <decimal value="0" />
                    </falseValue>
                </boolean>
            </elements>
        </policy>

        <!-- SHA-256 -->
        <policy name="SHA256" class="Machine" displayName="$(string.SHA256)" explainText="$(string.SHA256_Help)" presentation="$(presentation.SHA256)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Hashes\SHA256">
            <parentCategory ref="Hashes" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="SHA256_Checkbox" valueName="Enabled">
                    <trueValue>
                        <decimal value="4294967295" />
                    </trueValue>
                    <falseValue>
                        <decimal value="0" />
                    </falseValue>
                </boolean>
            </elements>
        </policy>

        <!-- SHA-384 -->
        <policy name="SHA384" class="Machine" displayName="$(string.SHA384)" explainText="$(string.SHA384_Help)" presentation="$(presentation.SHA384)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Hashes\SHA384">
            <parentCategory ref="Hashes" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="SHA384_Checkbox" valueName="Enabled">
                    <trueValue>
                        <decimal value="4294967295" />
                    </trueValue>
                    <falseValue>
                        <decimal value="0" />
                    </falseValue>
                </boolean>
            </elements>
        </policy>

        <!-- SHA-512 -->
        <policy name="SHA512" class="Machine" displayName="$(string.SHA512)" explainText="$(string.SHA512_Help)" presentation="$(presentation.SHA512)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\Hashes\SHA512">
            <parentCategory ref="Hashes" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="SHA512_Checkbox" valueName="Enabled">
                    <trueValue>
                        <decimal value="4294967295" />
                    </trueValue>
                    <falseValue>
                        <decimal value="0" />
                    </falseValue>
                </boolean>
            </elements>
        </policy>


        <!-- KEY EXCHANGE ALGORITHMS -->

        <!-- Diffie-Hellman -->
        <policy name="DH" class="Machine" displayName="$(string.DH)" explainText="$(string.DH_Help)" presentation="$(presentation.DH)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\KeyExchangeAlgorithms\DH">
            <parentCategory ref="KeyEx" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="DH_Checkbox" valueName="Enabled">
                    <trueValue>
                        <decimal value="4294967295" />
                    </trueValue>
                    <falseValue>
                        <decimal value="0" />
                    </falseValue>
                </boolean>
            </elements>
        </policy>

        <policy name="PKCS" class="Machine" displayName="$(string.PKCS)" explainText="$(string.PKCS_Help)" presentation="$(presentation.PKCS)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\KeyExchangeAlgorithms\PKCS">
            <parentCategory ref="KeyEx" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="PKCS_Checkbox" valueName="Enabled">
                    <trueValue>
                        <decimal value="4294967295" />
                    </trueValue>
                    <falseValue>
                        <decimal value="0" />
                    </falseValue>
                </boolean>
            </elements>
        </policy>

        <policy name="ECDH" class="Machine" displayName="$(string.ECDH)" explainText="$(string.ECDH_Help)" presentation="$(presentation.ECDH)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\SCHANNEL\KeyExchangeAlgorithms\ECDH">
            <parentCategory ref="KeyEx" />
            <supportedOn ref="windows:SUPPORTED_WindowsNET" />
            <elements>
                <boolean id="ECDH_Checkbox" valueName="Enabled">
                    <trueValue>
                        <decimal value="4294967295" />
                    </trueValue>
                    <falseValue>
                        <decimal value="0" />
                    </falseValue>
                </boolean>
            </elements>
        </policy>


    </policies>
</policyDefinitions>
